benchmarks/final_opt_6.7b_A6000_math500_selective_validation/colocation_consolidated_linear_0.1_7_0_12_math500_output.txt
INFO 06-16 19:17:55 [__init__.py:239] Automatically detected platform cuda.
Namespace(backend='vllm', base_url=None, host='127.0.0.1', port=8100, endpoint='/v1/completions', dataset_name='math500', dataset_path=None, max_concurrency=None, model='facebook/opt-6.7b', tokenizer=None, use_beam_search=False, duration_minutes=10.0, logprobs=None, request_rate=12.0, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el,token_latency', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=0.0, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Loaded 500 samples from cache from HuggingFaceH4/cache/math500_facebook/opt-6.7b.json
Split dataset into 50 test samples and 450 training samples
Temperature:  0.0
Running test split to train selective validator...
Checking server health at http://127.0.0.1:8100/health
Waiting for server to start...
Checking server health at http://127.0.0.1:8100/health
Waiting for server to start...
Checking server health at http://127.0.0.1:8100/health
Waiting for server to start...
Checking server health at http://127.0.0.1:8100/health
Waiting for server to start...
Checking server health at http://127.0.0.1:8100/health
Waiting for server to start...
Checking server health at http://127.0.0.1:8100/health
Waiting for server to start...
Checking server health at http://127.0.0.1:8100/health
Waiting for server to start...
Checking server health at http://127.0.0.1:8100/health
Waiting for server to start...
Checking server health at http://127.0.0.1:8100/health
Waiting for server to start...
Checking server health at http://127.0.0.1:8100/health
Waiting for server to start...
Checking server health at http://127.0.0.1:8100/health
Waiting for server to start...
Checking server health at http://127.0.0.1:8100/health
Waiting for server to start...
Checking server health at http://127.0.0.1:8100/health
Waiting for server to start...
Checking server health at http://127.0.0.1:8100/health
Waiting for server to start...
Checking server health at http://127.0.0.1:8100/health
Waiting for server to start...
Checking server health at http://127.0.0.1:8100/health
Waiting for server to start...
Checking server health at http://127.0.0.1:8100/health
Waiting for server to start...
Checking server health at http://127.0.0.1:8100/health
Server is ready!
result {'is_trained': False}
Running test requests 1 to 128 (cycling through 50 requests)
Checking server health at http://127.0.0.1:8100/health
Server is ready!
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 12.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
result {'is_trained': False}
Running test requests 129 to 256 (cycling through 50 requests)
Checking server health at http://127.0.0.1:8100/health
Server is ready!
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 12.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
result {'is_trained': False}
Running test requests 257 to 384 (cycling through 50 requests)
Checking server health at http://127.0.0.1:8100/health
Server is ready!
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 12.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
result {'is_trained': False}
Running test requests 385 to 512 (cycling through 50 requests)
Checking server health at http://127.0.0.1:8100/health
Server is ready!
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 12.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
result {'is_trained': False}
Running test requests 513 to 640 (cycling through 50 requests)
Checking server health at http://127.0.0.1:8100/health
Server is ready!
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 12.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
result {'is_trained': True}
Selective validator trained after 640 test requests (99.23 seconds)
Running full benchmark...
Checking server health at http://127.0.0.1:8100/health
Server is ready!
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 12.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
Benchmark duration: 10.0 minutes
============ Serving Benchmark Result ============
Successful requests:                     6570      
Benchmark duration (s):                  600.22    
Total input tokens:                      476231    
Total generated tokens:                  1455887   
Request throughput (req/s):              10.95     
Output token throughput (tok/s):         2425.60   
Total Token throughput (tok/s):          3219.04   
---------------Time to First Token----------------
Mean TTFT (ms):                          11232.17  
Median TTFT (ms):                        3783.36   
P99 TTFT (ms):                           36507.02  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          77.77     
Median TPOT (ms):                        69.76     
P99 TPOT (ms):                           190.28    
---------------Inter-token Latency----------------
Mean ITL (ms):                           342.09    
Median ITL (ms):                         324.19    
P99 ITL (ms):                            760.13    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          26098.48  
Median E2EL (ms):                        23311.81  
P99 E2EL (ms):                           74289.20  
-----Token Latency (e2e_latency / output_len)-----
Mean Token Latency (ms):                 167.39    
Median Token Latency (ms):               106.93    
P99 Token Latency (ms):                  817.49    
==================================================